/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_printf.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gkshleri <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/01/26 13:01:47 by gkshleri          #+#    #+#             */
/*   Updated: 2019/01/26 13:34:22 by gkshleri         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

int		ft_printf(const char *argv, ...)
{
	va_list	ap;
	char	arr;
	int		i;

	i = 0;
	va_start(ap, argv);
	while (argv[i])
	{
		if (argv[i] == '%')
		{
			if(!(parsing((char *)argv, ap)))
				return (0); // ошибка сборки, невалид. данные;
			i++;
		}
		else
			printf("%c", argv[i]);
			/* какая - то фукнция для обработки обычных
			 * данных, которые нужно вывести */
		i++;
	}
	return (0);
}
