/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   print_free.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: breolson <breolson@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/01/30 05:32:58 by breolson          #+#    #+#             */
/*   Updated: 2019/01/31 14:15:29 by gkshleri         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

// печатает строку, фришит память + запоминает сколько байт вывел

void		ft_print_free(char *str, t_lists *list, int max)
{
	int 	i;

	i = 0;
	if (!str)
		return ;
	while (max)
	{
		write(1, str++, 1);
		max--;
		i++;
	}
	list->len += i;
}
